Tutorials-2.4.0/mixingChanngel-1-Central/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingCentralFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         30; //1e-5; //60.4e-3;

deltaT          1e-3; //2.5e-5;

writeControl    adjustableRunTime;

writeInterval   5e-2; //0.05e-6; //1.0e-3;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable true;

adjustTimeStep	true;

maxCo		0.5;

CourantType	cellCourant;



// ************************************************************************* //
