Tutorials-2.4.0/mixingChanngel-1-Central/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    outlet
    {
	type            totalPressure;
	value		uniform 1e5;
	p0		uniform 1e5;
	phi		phi;
	rho		rho;
	psi		none;
	gamma		1.4;
    }

    inlet1
    {
        type            zeroGradient;
    }

    inlet2
    {
        type            zeroGradient;
    }

    walls
    {
        type            slip;
    }


    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
